{
  "total_sessions": 104,
  "pages_fetched": 3,
  "sessions": [
    {
      "id": 31541312,
      "name": "Seattle chapter tours: Exclusive AAJA Pike Place AAPI tour",
      "description": "<p><strong>Date</strong>: Tuesday, July 29 at 2:30 p.m.</p>\n<p><strong>Cost</strong>: $119 per ticket</p>\n<p><strong>Description</strong>: A tailor-made experience just for the AAJA group. Limited to 16 people. This exclusive behind-the-scenes tour at Pike Place Market will highlight some of the AAPI business owners in the market, in addition to learning and tasting a variety of cuisines represented in the market. Hear from some of the AAPI business owners about their personal experiences and stories. Minimum of 12 participants needed to make this tour happen, confirmation will be sent out prior to the tour.</p>\n<p><strong>Sign Up and Payment:</strong><a href=\"https://docs.google.com/forms/d/e/1FAIpQLSfDrTmQXi3rtVipn1ZdkK5fdLzBILzcusrYO02ab2TZLuN8kQ/viewform\"><strong> </strong><u>https://docs.google.com/forms/d/e/1FAIpQLSfDrTmQXi3rtVipn1ZdkK5fdLzBILzcusrYO02ab2TZLuN8kQ/viewform</u></a></p>",
      "start_time": "2025-07-29T21:30:00.000000+0000",
      "day": "Tue 7/29",
      "time": "2:30 PM PDT",
      "locations": [
        "Other"
      ],
      "tracks": [
        "Mixers/Receptions"
      ]
    },
    {
      "id": 31496788,
      "name": "Covering civic life through a solutions lens (Presented by SJN)",
      "description": "<p>In an era of political polarization, disinformation and institutional distrust, journalism’s traditional emphasis on dysfunction often leaves audiences feeling overwhelmed, disillusioned and disengaged. But what if our reporting could restore agency, inspire civic participation and rebuild trust?</p>\n<br>\n<p>This hands-on workshop introduces solutions journalism — a rigorous, evidence-based framework for reporting not just on problems, but on how people and institutions are responding. Participants will explore how solutions-focused stories can deepen public understanding of democracy, elevate underreported voices and help audiences imagine a more just and functional future.</p>\n<p>We’ll unpack the limits of the conventional “watchdog” model of journalism and explore how shifting toward response-driven reporting — especially in coverage of civic life, elections, local government and social movements — can more effectively serve our communities. This approach is especially vital for Asian American journalists and other journalists of color, whose communities are often stereotyped, ignored or flattened in mainstream narratives.</p>\n<p>Through real-world case studies, peer examples and exercises, participants will learn how to:</p>\n<ul>\n<li>Identify and pitch democracy-related solutions stories;</li>\n<li>Report “howdunits” that reveal not just what’s broken, but also how people are solving these problems;</li>\n<li>Avoid audience burnout while increasing impact;</li>\n<li>Use solutions reporting to foster trust, bridge divides and amplify civic agency.</li>\n</ul>\n<p>Whether you’re covering government accountability, grassroots organizing or efforts to heal fractured communities, this session offers concrete tools to evolve your craft — and contribute to a journalism legacy that informs, empowers and uplifts.</p>",
      "start_time": "2025-07-30T17:30:00.000000+0000",
      "day": "Wed 7/30",
      "time": "10:30 AM PDT",
      "locations": [
        "REDWOOD"
      ],
      "tracks": [
        "Training"
      ]
    },
    {
      "id": 31496789,
      "name": "Physical safety with the International Women’s Media Foundation (Presented by IWMF)",
      "description": "<p>Join this hands-on workshop facilitated by journalism safety experts from the International Women’s Media Foundation. This session will teach you how to prepare for threats against your physical safety, including conducting identity-aware risk assessments to prepare for assignments and dealing with risks while reporting in the field. The training will cover mapping of actors, security protocols and contingency planning, police tactics, personal protective equipment, and what to do if arrested or detained. This workshop is open to editors, staff, and freelance journalists.</p>",
      "start_time": "2025-07-30T17:30:00.000000+0000",
      "day": "Wed 7/30",
      "time": "10:30 AM PDT",
      "locations": [
        "METROPOLITAN A"
      ],
      "tracks": [
        "Training"
      ]
    },
    {
      "id": 31496790,
      "name": "EXPO",
      "description": "<p>The AAJA25 Expo is your gateway to career opportunities, industry insights, and meaningful connections. Whether you&#x27;re seeking interviews, exploring job openings, or simply curious about different media companies, the Expo is the place to be.</p>\n<br>\n<p>Meet with recruiters from top news organizations, learn what they’re looking for, and gain a deeper understanding of newsroom culture and hiring practices. Whether you&#x27;re just starting out or looking to make your next move, the Expo offers valuable face time with industry leaders and a chance to take the next step in your journalism journey.</p>",
      "start_time": "2025-07-30T19:00:00.000000+0000",
      "day": "Wed 7/30",
      "time": "12 PM PDT",
      "locations": [
        "GRAND BALLROOM"
      ],
      "tracks": []
    },
    {
      "id": 31496791,
      "name": "Follow the money: Covering the new American oligarch (Presented by Brennan Center for Justice at NYU)",
      "description": "<p>Billionaire campaign donors like Elon Musk are bending the federal government to their will. While the corrupting influence of big money on politics isn’t new, today’s threats are distinct, with fewer limits than ever before on what megadonors can do to enrich their companies and themselves at the expense of everyday Americans. Join us for a discussion on how journalism is covering the new American oligarchy so far. Campaign finance reporters will join Brennan Center experts to talk about the stories emerging from this unique moment. Is the press succeeding in bringing them to the public? Are journalists missing anything? The panel will offer best practices for working with donor data, campaign finance regulations and other information necessary to draw a picture of what’s happening and who benefits. They will explore how the new oligarchy’s power is showing up in so many spheres of American life, its implications for communities of color and how journalists can meet the moment.</p>",
      "start_time": "2025-07-30T19:30:00.000000+0000",
      "day": "Wed 7/30",
      "time": "12:30 PM PDT",
      "locations": [
        "ASPEN"
      ],
      "tracks": [
        "Training"
      ]
    },
    {
      "id": 31496792,
      "name": "Beyond the mushy middle: How to lead with your reporting (Presented by The Athletic)",
      "description": "<p>We’re in a moment where the competition for eyeballs and attention is fierce. Newsrooms are navigating challenges on social and search, and staff and budgets are being slashed. With so much content and the emergence of AI, it can sometimes be hard to discern what’s real or fake. But strong reporting is what makes you rise above the rest. Strong reporting teaches someone something new. It takes them behind the scenes of a story. It provides analysis of the “why” behind the “what.” It is compelling, interesting — and maybe even fun. Strong reporting helps you win the day on your beat whenever you publish a story. It gets your story to lead the daily ticker. It’s being the authoritative voice on news that matters to your readers and viewers. At The Athletic, it’s avoiding what our editors have coined the “messy middle.” The messy middle is dutiful, not impactful, coverage. During this 90-minute session, we will explain how The Athletic approaches reporting through the perspective of reporters, editors and producers, as well as those who amplify their work: social media editors and programmers. We also will split off into small groups for participants to ask questions and share work with the panelists.</p>\n<br>\n<p><strong>Intended takeaways from this workshop:</strong></p>\n<ul>\n<li>Creativity + ideation with your editor</li>\n<li>How to win on your beat every day</li>\n<li>Relationship/source development</li>\n<li>Being a pro on the beat + holding yourself to a higher standard</li>\n<li>Ways to bolster your storytelling</li>\n<li>Cross-promoting + amplifying your work</li>\n<li>AANHPI coverage: data + trends</li>\n</ul>",
      "start_time": "2025-07-30T19:30:00.000000+0000",
      "day": "Wed 7/30",
      "time": "12:30 PM PDT",
      "locations": [
        "METROPOLITAN B"
      ],
      "tracks": [
        "Training"
      ]
    },
    {
      "id": 31496794,
      "name": "The evolving power and complexity of the AAPI electorate (Presented by APIAVote)",
      "description": "<p>Asian Americans and Pacific Islanders are the fastest-growing electorate. As their numbers and influence increase, understanding their voting patterns, motivations and barriers has never been more critical. This session explores key trends in turnout, party preference, issue salience and voting challenges uniquely affecting AAPI communities.</p>\n<br>\n<p>From language access to voter mobilization and decreasing enthusiasm, Christine Chen, co-founder and executive director of APIAVote, along with grassroots organizers from Washington state and beyond, will share what they’re seeing on the ground — and how journalists can better cover AAPI stories in this pivotal moment.</p>",
      "start_time": "2025-07-30T19:30:00.000000+0000",
      "day": "Wed 7/30",
      "time": "12:30 PM PDT",
      "locations": [
        "REDWOOD"
      ],
      "tracks": [
        "Community",
        "Training"
      ]
    },
    {
      "id": 31515823,
      "name": "AI tools to amplify your journalism without replacing your judgment",
      "description": "<p>Discover how AI can handle the grunt work so you can focus on your journalism. This session will demo practical applications of various AI tools from NotebookLM to Claude, Fathom and others for research, transcription, and story development. By the end of this session, you’ll leave with a wider perspective of different AI tools that will allow you to work smarter, not harder.</p>",
      "start_time": "2025-07-30T19:30:00.000000+0000",
      "day": "Wed 7/30",
      "time": "12:30 PM PDT",
      "locations": [
        "CEDAR"
      ],
      "tracks": [
        "Innovation",
        "Training"
      ]
    },
    {
      "id": 31515824,
      "name": "Turn on the radio (Presented by The James B. McClatchy Foundation)",
      "description": "<p>The team from The Intersection, Central Valley Journalism Collaborative’s Health Equity Reporting Lab, discuss how small newsrooms can use audio reporting to increase audience, impact, partnerships and brand recognition, and how to start producing radio and podcasts from scratch.</p>",
      "start_time": "2025-07-30T19:30:00.000000+0000",
      "day": "Wed 7/30",
      "time": "12:30 PM PDT",
      "locations": [
        "METROPOLITAN A"
      ],
      "tracks": [
        "Training"
      ]
    },
    {
      "id": 31360096,
      "name": "First timer orientation",
      "description": "<p>Are you excited about attending your first AAJA convention? Join our orientation session to connect with fellow first-timers, hear from experienced members, and gain invaluable tips to make the most of your convention experience. This is your chance to kick-start your convention journey and establish lasting connections.</p>",
      "start_time": "2025-07-30T21:30:00.000000+0000",
      "day": "Wed 7/30",
      "time": "2:30 PM PDT",
      "locations": [
        "CEDAR"
      ],
      "tracks": []
    },
    {
      "id": 31496793,
      "name": "So, you're thinking of starting a nonprofit news organization",
      "description": "<p>In the face of layoffs at established newsrooms and community demand for more targeted news coverage, you might be thinking it’s time to start your own nonprofit news organization. What does it really take to start your own news organization? Where do you find the money? Do you even know what a 501(c)3 is? We’ll talk to local founders and funders about entrepreneurship in the nonprofit world and the pitfalls and rewards of going the nonprofit route.</p>",
      "start_time": "2025-07-30T21:30:00.000000+0000",
      "day": "Wed 7/30",
      "time": "2:30 PM PDT",
      "locations": [
        "ASPEN"
      ],
      "tracks": [
        "Leadership",
        "Innovation",
        "Training"
      ]
    },
    {
      "id": 31535471,
      "name": "Prying loose public records (Presented by Investigative Reporters & Editors)",
      "description": "<p>A broad introduction to using open records laws at the federal and state levels, customized for your coverage area. You’ll also receive a checklist of all you need to know before you make a request.</p>",
      "start_time": "2025-07-30T21:30:00.000000+0000",
      "day": "Wed 7/30",
      "time": "2:30 PM PDT",
      "locations": [
        "REDWOOD"
      ],
      "tracks": [
        "Training"
      ]
    },
    {
      "id": 31517041,
      "name": "History happy hour: A book signing for AAJA and UCLA’s “Intersections”",
      "description": "<p>Meet contributors to the new book “Intersections: A Journalistic History of Asian Pacific America,” published by AAJA in partnership with UCLA’s Asian American Studies Center. Through short essays and profiles, the book shows how AAPI journalists and communities have been part of historic news coverage. This is your chance to get your copy of the book signed and talk with contributors about why they joined the book project.</p>",
      "start_time": "2025-07-30T23:00:00.000000+0000",
      "day": "Wed 7/30",
      "time": "4 PM PDT",
      "locations": [
        "METROPOLITAN A"
      ],
      "tracks": [
        "Mixers/Receptions"
      ]
    },
    {
      "id": 31360094,
      "name": "#AAJA25 opening reception (Presented by ABC and ESPN)",
      "description": "<p>Join fellow attendees at the AAJA25 Opening Reception—a lively celebration to wrap up Day One and set the tone for the rest of the week ahead.</p>",
      "start_time": "2025-07-30T23:30:00.000000+0000",
      "day": "Wed 7/30",
      "time": "4:30 PM PDT",
      "locations": [
        "METROPOLITAN A"
      ],
      "tracks": [
        "Mixers/Receptions"
      ]
    },
    {
      "id": 31496795,
      "name": "AAJA Asia chapter mixer",
      "description": "<p>Soak in Seattle’s golden hour with stunning views of Elliott Bay and the Olympic Mountains—one of the city’s best waterfront beer moments. After the opening reception, head over to Old Stove Brewing Co. at Pike Place Market (just a 12-minute walk from the Sheraton) for good brews, scratch-made food, and great company. <br>🗓 Wednesday, July 30<br>🕡 6:30–8:00 PM<br>1901 Western Ave, Seattle, WA 98101<br>No RSVP required, but we’d love a heads-up. Feel free to bring friends! <a href=\"https://forms.gle/N5pn4JbZTZUeSv749\" target=\"_blank\">https://forms.gle/N5pn4JbZTZUeSv749</a></p>",
      "start_time": "2025-07-31T01:30:00.000000+0000",
      "day": "Wed 7/30",
      "time": "6:30 PM PDT",
      "locations": [
        "Other"
      ],
      "tracks": [
        "Mixers/Receptions"
      ]
    },
    {
      "id": 31526353,
      "name": "AAJA Broadcast Futures fundraising reception",
      "description": "<p>Join us to celebrate AAJA members working in local radio and television newsrooms across the country! Proceeds from this year&#x27;s ticket sales will primarily benefit the AAJA Futures Fund. Registration and ticket purchase required in advance by invitation.</p>\n<br>\n<p><u><a href=\"https://www.zeffy.com/ticketing/broadcast-futures\" target=\"_blank\">https://www.zeffy.com/ticketing/broadcast-futures</a></u></p>",
      "start_time": "2025-07-31T01:30:00.000000+0000",
      "day": "Wed 7/30",
      "time": "6:30 PM PDT",
      "locations": [
        "Other"
      ],
      "tracks": [
        "Mixers/Receptions"
      ]
    },
    {
      "id": 31496796,
      "name": "AARP breakfast dialogue: Intergenerational talk, story with OGs across generations (Presented by AARP)",
      "description": "<p>Last year, journalists of different generations came together in this informal exchange with a range of panelists whose careers have led them to deep engagement with diverse communities and inspiring examples of turning their journalistic backgrounds into new impactful efforts that advance AAPI and other communities. Their journeys reflect a range of fascinating paths into community/ethnic media; communications/advertising; documentary production; nonprofit legal advocacy; playwriting and Zen priesthood; and much more. Come with questions and curiosity to see how other journalists morphed their careers into more direct community involvement and impact — and we hope to hear about yours. Coffee, tea and a light breakfast generously sponsored by AARP.</p>\n<br>\n<p>You must RSVP by clicking on “Register now” below.</p>",
      "start_time": "2025-07-31T15:00:00.000000+0000",
      "day": "Thu 7/31",
      "time": "8 AM PDT",
      "locations": [
        "METROPOLITAN B"
      ],
      "tracks": [
        "Community"
      ]
    },
    {
      "id": 31496797,
      "name": "Immigration in the second Trump era",
      "description": "<p>Immigration was a key topic during Trump’s campaign for president and in the first months of his second administration, playing out in executive orders, courtrooms and on the ground. Our panel discusses what has changed since his first administration and how journalists can find and report meaningful, impactful stories in a world where the situation changes day by day. </p>",
      "start_time": "2025-07-31T16:00:00.000000+0000",
      "day": "Thu 7/31",
      "time": "9 AM PDT",
      "locations": [
        "ASPEN"
      ],
      "tracks": [
        "Community"
      ]
    },
    {
      "id": 31496798,
      "name": "How to put subscribers at the center of your journalism and build a sustainable business (Presented by Seattle Times)",
      "description": "<p>Centering subscribers at the core of your daily practice improves your journalism and helps you drive loyalty and revenue for the future. The Seattle Times has met aggressive subscription goals by focusing relentlessly on giving readers what they want — fast, reliable breaking news and richly reported and presented enterprise — when, where and how they want it. In this panel, Times staff members peel back the curtain on the strategies they've adopted to create journalism that resonates with communities and wins subscribers.</p>",
      "start_time": "2025-07-31T16:00:00.000000+0000",
      "day": "Thu 7/31",
      "time": "9 AM PDT",
      "locations": [
        "CEDAR"
      ],
      "tracks": [
        "Community"
      ]
    },
    {
      "id": 31496799,
      "name": "EXPO",
      "description": "<p>The AAJA25 Expo is your gateway to career opportunities, industry insights, and meaningful connections. Whether you&#x27;re seeking interviews, exploring job openings, or simply curious about different media companies, the Expo is the place to be.</p>\n<br>\n<p>Meet with recruiters from top news organizations, learn what they’re looking for, and gain a deeper understanding of newsroom culture and hiring practices. Whether you&#x27;re just starting out or looking to make your next move, the Expo offers valuable face time with industry leaders and a chance to take the next step in your journalism journey.</p>",
      "start_time": "2025-07-31T16:00:00.000000+0000",
      "day": "Thu 7/31",
      "time": "9 AM PDT",
      "locations": [
        "GRAND BALLROOM"
      ],
      "tracks": []
    },
    {
      "id": 31496800,
      "name": "Style and standards: Telling our stories with nuance and integrity (Presented by AAJA Style Guide Committee and AAJA Media Watch)",
      "description": "<p>How do we ensure that coverage of our communities reflects the full complexity of who we are—without flattening identities into clichés or incomplete narratives? This panel explores how newsroom standards and style guides are not just reference documents, but active tools that shape reporting, editing, and headline-writing every day. Join standards editors from major newsrooms and members of the AAJA Style Guide Committee for a conversation on how style and standards shape coverage in real time—and why they matter more than ever.</p>",
      "start_time": "2025-07-31T16:00:00.000000+0000",
      "day": "Thu 7/31",
      "time": "9 AM PDT",
      "locations": [
        "METROPOLITAN A"
      ],
      "tracks": [
        "Training"
      ]
    },
    {
      "id": 31496801,
      "name": "NBCU Academy: In conversation with Vicky Nguyen: Identity, resilience and breaking through (Presented by NBC)",
      "description": "<p>In her deeply personal new memoir, <em>Boat Baby: A Memoir</em>, NBC News anchor and correspondent Vicky Nguyen pays tribute to her parents’ sacrifice and the journey that brought her from refugee to national news anchor. In this inspiring conversation, Nguyen shares how her Vietnamese American identity shaped her path in journalism, the lessons she learned from local newsrooms across the country, and how she brings her full self to the anchor desk. Don’t miss this powerful session on belonging, perseverance and what it means to tell stories that matter — from the inside out.</p>\n<br>\n<p>This session is part of the NBCU Academy Workshops and is open to all convention participants. To learn more about NBCU Academy at AAJA: <a href=\"https://nbcuacademy.com/event/aaja-2025/\">https://nbcuacademy.com/event/aaja-2025/</a></p>",
      "start_time": "2025-07-31T16:00:00.000000+0000",
      "day": "Thu 7/31",
      "time": "9 AM PDT",
      "locations": [
        "WILLOW"
      ],
      "tracks": [
        "Leadership"
      ]
    },
    {
      "id": 31536811,
      "name": "The ABC News storytellers summit",
      "description": "<p>The ABC News Storytellers Summit is a half-day development workshop created by ABC News and the ABC Owned Television Stations. It’s designed to bring together producers, writers, reporters and content creators for cutting-edge conversations and training sessions to take their storytelling to the next level.</p>\n<p>The workshop is led by ABC News journalists and executives from across all platforms and shows. Participants will gain first-hand insight into the skills that make ABC News the No. 1 source for news—and discover innovative ways to elevate their storytelling.</p>\n<p><strong>OVERVIEW:</strong></p>\n<p>Thursday, July 31<br>10 a.m.–2 p.m.</p>\n<ul>\n<li>Panels and discussions with ABC News executives and talent</li>\n<li>Producing workshops and more</li>\n<li>Networking sessions and career advice</li>\n</ul>\n<p><strong>HOW TO APPLY:</strong></p>\n<p><em>Applicants must be registered for the AAJA 2025 Convention.</em></p>\n<p><em>The ABC News Storytellers Summit encourages the following to apply:</em></p>\n<ul>\n<li><em>Producers, writers, reporters and content creators with <strong>three or more years of experience</strong></em></li>\n<li><em>Seasoned storytellers seeking innovative ways to create compelling news content</em></li>\n</ul>\n<p><strong>APPLY HERE: </strong><u><a href=\"https://forms.gle/bCTjCyYHKidvg5H29\">https://forms.gle/bCTjCyYHKidvg5H29</a></u></p>\n<p><strong>DEADLINE: JULY 24</strong></p>",
      "start_time": "2025-07-31T17:00:00.000000+0000",
      "day": "Thu 7/31",
      "time": "10 AM PDT",
      "locations": [
        "METROPOLITAN A"
      ],
      "tracks": [
        "Training"
      ]
    },
    {
      "id": 31496802,
      "name": "Covering democracy under Trump",
      "description": "<p>Much has changed since the start of the second Trump administration, with real impacts to local governments and communities with consequences that are felt far from D.C. In this panel, we will discuss how to navigate local and niche coverage without drowning in an overwhelming tidal wave of information — such as how to find local angles to national stories, build trust and transparency with current and new\\ audiences, ideas for keeping workflow manageable and avoiding staff and reader burnout, all while filtering out the noise. </p>",
      "start_time": "2025-07-31T17:30:00.000000+0000",
      "day": "Thu 7/31",
      "time": "10:30 AM PDT",
      "locations": [
        "ASPEN"
      ],
      "tracks": [
        "Community"
      ]
    },
    {
      "id": 31496803,
      "name": "Harnessing the power of local journalism to serve our communities",
      "description": "<p>With a new administration testing the limits of democratic institutions that impact communities nationwide, local news is more important than ever – even as the industry continues to face financial hits. This session will be an interactive workshop with tangible exercises, led by organizations such as the Solutions Journalism Network, which are doing the work to cover local communities in a time of disinformation, declining trust in media and political polarization. We’ll also look at how to effectively partner with community organizations, incorporate more local sources and brainstorm story ideas. </p>",
      "start_time": "2025-07-31T17:30:00.000000+0000",
      "day": "Thu 7/31",
      "time": "10:30 AM PDT",
      "locations": [
        "CEDAR"
      ],
      "tracks": [
        "Community",
        "Training"
      ]
    },
    {
      "id": 31515825,
      "name": "Breaking barriers: AAPI women leading in corporate America",
      "description": "<p>From the boardroom to the C-suite, AAPI women continue to challenge stereotypes and reshape leadership in some of the world’s most influential companies. Join dynamic leaders from JPMorgan Chase, Lush Decor and the Council of Korean Americans as they share personal stories, career insights and the realities of navigating identity, culture and power in the corporate world. This conversation will explore how they lead with authenticity, advocate for equity, and build pathways for the next generation — all through the lens of their experiences as AAPI women.</p>",
      "start_time": "2025-07-31T17:30:00.000000+0000",
      "day": "Thu 7/31",
      "time": "10:30 AM PDT",
      "locations": [
        "METROPOLITAN A"
      ],
      "tracks": [
        "Leadership"
      ]
    },
    {
      "id": 31522519,
      "name": "Storytelling, visualization and data: Insights from the Field",
      "description": "<p>Asian American and Pacific Islander communities are rapidly growing and evolving. They encompass the fastest-growing racial groups in America, and they continue to transform business, society and politics in familiar places as well in new destinations. The post-1965 immigrant wave is reshaping how we understand the elderly in America, while the growth of younger generations is transforming politics — from Zohran Mamdani in New York and Derek Tran in California, to Kash Patel and Steven Cheung in D.C. <br>  <br> At the same time, there continue to be misperceptions and uncertainties around various issues, including who undocumented Asian Americans are and where different segments of our community stand on issues like deportations, taxes, government spending and a variety of social issues. <br>  <br> Join us for an interactive conversation among journalists and data experts on ways to improve storytelling and public understanding through better use of data and data visualization. <br> </p>",
      "start_time": "2025-07-31T17:30:00.000000+0000",
      "day": "Thu 7/31",
      "time": "10:30 AM PDT",
      "locations": [
        "METROPOLITAN B"
      ],
      "tracks": [
        "Innovation",
        "Training"
      ]
    },
    {
      "id": 31496804,
      "name": "NBCU Academy workshop: The art of the interview — asking questions that matter (plus HelloHive)",
      "description": "<p>Great interviews are built on thoughtful questions, sharp instincts and genuine curiosity. In this interactive session, you’ll learn the art of asking better questions — from setting the tone to knowing when to stay silent. Through real-world examples and guided discussions, you’ll gain practical tools to build trust, spark emotion or unlock a headline. We’ll cover techniques for approaching interviews with public officials, experts and people affected by breaking or tragic events. Whether reporting for on-air, print or digital platforms, this session will help you grow not just as a journalist but as a better communicator, listener and storyteller.</p>\n<br>\n<p>This session is part of the NBCU Academy Workshops and is open to all convention participants. However, if you’d like to take part in the interactive interview sessions with an NBCU professor, please apply in advance here: <a href=\"https://nbcuacademy.com/event/aaja-2025/\">https://nbcuacademy.com/event/aaja-2025/</a></p>",
      "start_time": "2025-07-31T17:45:00.000000+0000",
      "day": "Thu 7/31",
      "time": "10:45 AM PDT",
      "locations": [
        "WILLOW"
      ],
      "tracks": [
        "Training"
      ]
    },
    {
      "id": 31496805,
      "name": "Level up: NBCU Academy’s exclusive journalism workshop experience",
      "description": "<p>Step inside the newsroom with NBCU Academy. We&#x27;re offering a one-day, invite-only experience packed with practical skills and powerful conversations with award-winning journalists from NBC News, NBCU Local, Telemundo, CNBC and MSNBC. Learn through immersive workshops on writing, interviewing and storytelling for TV, streaming and digital — all with real-time feedback. Participants will also get exclusive access to the HelloHive team, who will offer advice on resumes. If you&#x27;re curious, driven and ready to grow, this is where your next level begins.<br> <br> To learn more about NBCU Academy at AAJA: <a href=\"https://nbcuacademy.com/event/aaja-2025/\">https://nbcuacademy.com/event/aaja-2025/</a></p>",
      "start_time": "2025-07-31T17:45:00.000000+0000",
      "day": "Thu 7/31",
      "time": "10:45 AM PDT",
      "locations": [
        "WILLOW"
      ],
      "tracks": [
        "Training"
      ]
    },
    {
      "id": 31496806,
      "name": "News Nerds networking casual lunch gathering",
      "description": "<p>Join the News Nerds for a casual networking lunch! Thursday July 31 11:30 -1 PM. </p>\n<br>\n<p>The mission of AAJA’s News Nerds is to bridge the gap between tech and the newsroom, by enhanced traditional storytelling methods through new data and technology, which is becoming more critical as the news industry continues changing rapidly. Its members consist of professionals who are data reporters, news developers, designers, audience engagement specialists and graphics reporters.</p>\n<br>\n<p>If your work touches technology, data, or coding in any way, we&#x27;d love for you to join us. Let&#x27;s connect, share ideas, and enjoy a relaxed meal together. </p>\n<br>\n<p>Everyone is welcome (bring a friend!), but RSVP is appreciated for reservations (not required!): <a href=\"https://aajanerds25.rsvpify.com/\">https://aajanerds25.rsvpify.com/</a></p>",
      "start_time": "2025-07-31T18:30:00.000000+0000",
      "day": "Thu 7/31",
      "time": "11:30 AM PDT",
      "locations": [
        "Other"
      ],
      "tracks": [
        "Mixers/Receptions"
      ]
    },
    {
      "id": 31539225,
      "name": "Seattle Times lunch and tour",
      "description": "<p>AAJA convention attendees are invited to visit The Seattle Times, meet Seattle Times editors and enjoy a hosted lunch with newsroom staff. Address and arrival instructions will be sent via email.</p>\n<p><br><strong>NOTE: Space is limited and RSVPs are required.</strong></p>\n<br>\n<p><a href=\"https://docs.google.com/forms/d/e/1FAIpQLScgXft0ICbaY_a2wlRky70I6oKMicsXaE_U31gx7Q6YbuShSA/viewform?usp=header\" target=\"_blank\">RSVP HERE</a></p>",
      "start_time": "2025-07-31T18:30:00.000000+0000",
      "day": "Thu 7/31",
      "time": "11:30 AM PDT",
      "locations": [
        "Other"
      ],
      "tracks": []
    },
    {
      "id": 31515827,
      "name": "Reporting power in a polarized world: Covering the White House and Congress in 2025",
      "description": "<p>In a year marked by deep political divisions, resurgent nationalism and global uncertainty, the task of covering America’s centers of power has never been more complex. From the high-stakes drama of a returning Trump administration to a bitterly polarized Congress, journalists must navigate not only the facts but also the public&#x27;s growing distrust of institutions and media itself. <br> <br>In a year marked by deep political divisions, resurgent nationalism and global uncertainty, the task of covering America’s centers of power has never been more complex. From the high-stakes drama of a returning Trump administration to a bitterly polarized Congress, journalists must navigate not only the facts but also the public&#x27;s growing distrust of institutions and media itself.</p>\n<br>\n<p>Join Weijia Jiang (CBS News) , Nick Wu (POLITICO), Scott Wong (NBC) and Amanda Barrett (AP) for an unfiltered conversation about the unique challenges of political reporting in 2025. How do correspondents maintain access and accountability amid disinformation and political hostility? What’s different about covering Trump 2.0? And how do domestic fractures play out on the global stage? This panel goes beyond headlines to explore the resilience, responsibility and reality of reporting on power today. </p>",
      "start_time": "2025-07-31T20:00:00.000000+0000",
      "day": "Thu 7/31",
      "time": "1 PM PDT",
      "locations": [
        "METROPOLITAN B"
      ],
      "tracks": [
        "Leadership"
      ]
    },
    {
      "id": 31522520,
      "name": "Soft power, bold leadership: Jonathan Sposato on redefining success in media and tech (Presented by JoySauce TV, Seattle Magazine and Seattle Business Magazine)",
      "description": "<p>What does it look like when Asian American identity becomes a catalyst — not a caveat — for bold leadership? In this intimate fireside chat, join serial entrepreneur and media changemaker Jonathan Sposato — the only founder to sell two startups to Google, chairman of GeekWire and founder of JoySauce Network — as he shares how empathy, representation and cultural confidence have guided his journey across tech and media. <br>  <br> From building tools used by millions to launching platforms that amplify Asian American voices, Sposato reflects on what it means to lead with purpose in industries often resistant to change. Learn how he’s leveraging his success to uplift inclusive storytelling, back underrepresented founders, and reimagine what power can look like when it’s rooted in identity.</p>",
      "start_time": "2025-07-31T20:00:00.000000+0000",
      "day": "Thu 7/31",
      "time": "1 PM PDT",
      "locations": [
        "ASPEN"
      ],
      "tracks": [
        "Leadership",
        "Community",
        "Innovation"
      ]
    },
    {
      "id": 31496807,
      "name": "CNBC presents: What every journalist should know about personal finance",
      "description": "<p>When you’re chasing deadlines or covering the latest market moves, your own finances can end up on the back burner. Knowing how to manage your money is just as important as knowing how to cover the story. Join Sharon Epperson, CNBC’s senior personal finance correspondent, for a candid and practical conversation about what every journalist—no matter your beat or career stage—should know about personal finance. Whether you’re just starting out or leveling up in your career, this is your opportunity to gain the tools and confidence to take charge of your financial future.</p>\n<br>\n<p>This session is part of the NBCU Academy Workshops and is open to all convention participants. To learn more about NBCU Academy at AAJA: <a href=\"https://nbcuacademy.com/event/aaja-2025/\">https://nbcuacademy.com/event/aaja-2025/</a></p>",
      "start_time": "2025-07-31T20:15:00.000000+0000",
      "day": "Thu 7/31",
      "time": "1:15 PM PDT",
      "locations": [
        "WILLOW"
      ],
      "tracks": [
        "Community"
      ]
    },
    {
      "id": 31524866,
      "name": "Vicky Nguyen’s book signing (presented by NBCU Academy)",
      "description": "<p>NBC News anchor and correspondent Vicky Nguyen signs copies of her new memoir “<em>Boat Baby.”</em></p>",
      "start_time": "2025-07-31T20:15:00.000000+0000",
      "day": "Thu 7/31",
      "time": "1:15 PM PDT",
      "locations": [
        "WILLOW"
      ],
      "tracks": [
        "Community"
      ]
    },
    {
      "id": 31496808,
      "name": "CNN MasterCraft: The digital essentials",
      "description": "<p>Are you looking to grow your skill set and thrive in this era of digital transformation in newsrooms? CNN’s industry-leading workshop is back this year with expert perspectives on how to elevate your storytelling, your story ideas and your story engagement across digital platforms. This dynamic, hands-on workshop is presented by CNN’s top newsroom leaders and talent executives, who will offer forward-thinking strategies on elevating your writing, editing, vertical video and real-time storytelling skills. This three-hour workshop will prepare the best and brightest journalists for the future and offer a window into how CNN is paving the way in creating engaging and thoughtful journalism for global digital audiences. </p>\n<br>\n<p>Link to apply: <a href=\"https://www.surveymonkey.com/r/AAJA2025\">https://www.surveymonkey.com/r/AAJA2025</a></p>",
      "start_time": "2025-07-31T21:00:00.000000+0000",
      "day": "Thu 7/31",
      "time": "2 PM PDT",
      "locations": [
        "CEDAR"
      ],
      "tracks": [
        "Training"
      ]
    },
    {
      "id": 31535472,
      "name": "So you want to be a modern-day storyteller (Presented by ESPN)",
      "description": "<p>Explore the evolving nature of storytelling and journalism careers in a conversation with three ESPN experts: Mina Kimes, podcaster, journalist and studio show veteran; Wright Thompson, New York Times best-selling author, senior writer and executive producer; and Xuan Thai, senior writer, producer and former network executive.</p>",
      "start_time": "2025-07-31T21:00:00.000000+0000",
      "day": "Thu 7/31",
      "time": "2 PM PDT",
      "locations": [
        "REDWOOD"
      ],
      "tracks": [
        "Innovation",
        "Training"
      ]
    },
    {
      "id": 31534778,
      "name": "‘Here’s the Scoop’: How to launch a successful podcast (Presented by NBCU Academy)",
      "description": "<p>It’s a running joke that everyone seems to have a podcast these days — but what does it take to launch a successful one? Join the leaders and hosts behind NBC News’ new daily podcast <em>Here’s the Scoop</em> for a frank discussion about standing out in a crowded field, finding an audience, and why journalists need to be able to tell stories across multiple platforms.</p>\n<br>\n<p>This session is part of the NBCU Academy Workshops and is open to all convention participants. However, if you’d like to have your script reviewed, please apply in advance here: <a href=\"https://nbcuacademy.com/event/aaja-2025/\">https://nbcuacademy.com/event/aaja-2025/</a></p>",
      "start_time": "2025-07-31T21:15:00.000000+0000",
      "day": "Thu 7/31",
      "time": "2:15 PM PDT",
      "locations": [
        "WILLOW"
      ],
      "tracks": [
        "Leadership"
      ]
    },
    {
      "id": 31496810,
      "name": "Crossing platforms, capturing audiences: Storytelling for the modern era (Presented by Dot Dash Meredith)",
      "description": "<p>Editors from Dotdash Meredith talk about how to reimagine storytelling that breaks through the noise. We’ve built cross-platform brands, are reaching outside the usual print and digital options, and have had success. Editors will also talk about working in legacy media and pivoting with the times.</p>",
      "start_time": "2025-07-31T21:30:00.000000+0000",
      "day": "Thu 7/31",
      "time": "2:30 PM PDT",
      "locations": [
        "ASPEN"
      ],
      "tracks": [
        "Innovation",
        "Training"
      ]
    },
    {
      "id": 31514468,
      "name": "Creating entrepreneurship systems that work for you/Secrets of full-time freelancers (Presented by Freelance AG)",
      "description": "<p>Between mass layoffs and an unstable job market, more journalists are freelancing out of need or by choice — and many are creating their own newsletters or startup businesses to support their work. This session will cover how to create systems that take work off your plate! You’ll see a demo of the Institute for Independent Journalists’ interactive online freelance startup guide, which helps answer the key questions for ramping up a side hustle into a full-time business. Panelists will share tools for setting your rate, networking to find great assignments, building relationships with clients, and juggling multiple projects. Participants will leave the session with a slew of new tools and strategies for making freelancing emotionally and financially sustainable.</p>",
      "start_time": "2025-07-31T21:30:00.000000+0000",
      "day": "Thu 7/31",
      "time": "2:30 PM PDT",
      "locations": [
        "METROPOLITAN B"
      ],
      "tracks": [
        "Training"
      ]
    },
    {
      "id": 31496811,
      "name": "NBCU Academy script doctor",
      "description": "<p>Great journalism doesn’t live in just one format. Whether you’re turning a digital article into a broadcast script or adapting an on-air story for digital, the power is in how you write and adapt. Hear from NBCU News Group journalists who’ve mastered storytelling across platforms, then get personalized feedback from local news directors and NBC News Digital editors. Bring a printed or digital copy of either a script or article. Sign up in advance to reserve your one-on-one critique.</p>\n<br>\n<p>This session is part of the NBCU Academy Workshops and is open to all convention participants. However, if you’d like to have your script reviewed, please apply in advance here: <a href=\"https://nbcuacademy.com/event/aaja-2025/\">https://nbcuacademy.com/event/aaja-2025/</a> <br> </p>",
      "start_time": "2025-07-31T22:15:00.000000+0000",
      "day": "Thu 7/31",
      "time": "3:15 PM PDT",
      "locations": [
        "WILLOW"
      ],
      "tracks": [
        "Training"
      ]
    },
    {
      "id": 31535473,
      "name": "What’s next for journalism and content creation — and how to build your place in it (Presented by ESPN)",
      "description": "<p>From streaming and newspapers to podcasts and live events, storytelling is happening across every platform. But where will it be in five years — and how can you build a lasting career in it? Hear from ESPN senior executives Chin Wang, vice president of design, creative systems and strategy; Mike McQuade, executive vice president of sports production; Mike Foss, senior vice president of sports studio and entertainment; and Kevin Neghandi, SportsCenter and studio host.</p>",
      "start_time": "2025-07-31T22:30:00.000000+0000",
      "day": "Thu 7/31",
      "time": "3:30 PM PDT",
      "locations": [
        "REDWOOD"
      ],
      "tracks": [
        "Innovation",
        "Training"
      ]
    },
    {
      "id": 31539915,
      "name": "An afternoon tea on political journalism with POLITICO",
      "description": "<p>Political reporting has rarely been more important or central to journalism as it is today. Join the POLITICO staff for a relaxed and engaging hour to learn about us and exciting opportunities with our growing reporting teams. Over tea and treats, you&#x27;ll connect with POLITICOs and fellow convention-goers to explore the dynamic world of political journalism — from breaking news to behind-the-scenes coverage of power and policy. <strong>Thursday, July 31, 3:30-4:30 p.m. </strong> We can&#x27;t wait to meet you!</p>",
      "start_time": "2025-07-31T22:30:00.000000+0000",
      "day": "Thu 7/31",
      "time": "3:30 PM PDT",
      "locations": [
        "Other"
      ],
      "tracks": [
        "Mixers/Receptions"
      ]
    },
    {
      "id": 31496822,
      "name": "Real and practical use cases for AI in your newsroom",
      "description": "<p>AI is here and it’s not going away. The technology is only getting better, faster and closer to making journalism easier. Hear from newsroom technologists and leaders on how they’re using AI in ethical ways to make news production more efficient. We’ll talk about how AI has sped up transcription, supported data cleanup and discovery, and deepened user engagement. </p>",
      "start_time": "2025-07-31T23:00:00.000000+0000",
      "day": "Thu 7/31",
      "time": "4 PM PDT",
      "locations": [
        "METROPOLITAN B"
      ],
      "tracks": [
        "Innovation",
        "Training"
      ]
    },
    {
      "id": 31515828,
      "name": "Building financial security in an unstable industry",
      "description": "<p>At a time when layoffs, freelance hustle and rising living costs challenge all of us, journalists across generations are rethinking what financial stability really means. In this panel, personal finance experts from JPMorgan Chase and Northwestern Mutual will break down real-world strategies tailored for journalists — especially those navigating the unique pressures and responsibilities within the AAPI community. From student loans and freelancing to family and retirement planning, this session will explore how to move from paycheck-to-paycheck toward long-term planning. Whether you&#x27;re just starting your first job, mid-career and managing caregiving, or a seasoned journalist eyeing legacy and retirement, this conversation will equip you with practical tools to take control of your financial future.</p>",
      "start_time": "2025-07-31T23:00:00.000000+0000",
      "day": "Thu 7/31",
      "time": "4 PM PDT",
      "locations": [
        "ASPEN"
      ],
      "tracks": [
        "Innovation",
        "Training"
      ]
    },
    {
      "id": 31535474,
      "name": "Society and sports: Telling stories that matter (Presented by ESPN)",
      "description": "<p>Where do stories about war, politics, health and identity meet the world of sports? Learn how ESPN journalists craft meaningful short- and longform narratives with Katie Barnes, senior writer and transgender sports issues expert; Maddie Rundlett, associate producer with E60 and ESPN Original Content; Elaine Teng, senior investigative editor; and Wright Thompson, senior writer and executive producer.</p>",
      "start_time": "2025-07-31T23:45:00.000000+0000",
      "day": "Thu 7/31",
      "time": "4:45 PM PDT",
      "locations": [
        "REDWOOD"
      ],
      "tracks": [
        "Training"
      ]
    },
    {
      "id": 31496813,
      "name": "Yung AAJA convention mixer",
      "description": "<p>Come join Yung AAJA for our annual convention mixer at ARTS at King Street Station! We'll have banh mi sandwiches available for attendees. </p>",
      "start_time": "2025-08-01T00:00:00.000000+0000",
      "day": "Thu 7/31",
      "time": "5 PM PDT",
      "locations": [
        "Other"
      ],
      "tracks": [
        "Mixers/Receptions"
      ]
    },
    {
      "id": 31496814,
      "name": "JCAMP + VOICES reception",
      "description": "<p>Celebrate the next generation of journalists at the JCamp &amp; VOICES Reception, honoring the incredible talent and hard work of AAJA’s student programs.</p>\n<br>\n<p>Meet the high school students of JCamp, a nationally recognized, six-day training program that brings together diverse young leaders from across the country to learn from top journalists and produce powerful multimedia stories.</p>\n<br>\n<p>Connect with the college students of VOICES, a premier collegiate fellowship where aspiring reporters cover stories on the journalism industry and AAPI community under the mentorship of experienced professionals.</p>\n<br>\n<p>Join us in recognizing these bright storytellers—and the mentors who guide them—who represent the future of journalism.</p>",
      "start_time": "2025-08-01T00:00:00.000000+0000",
      "day": "Thu 7/31",
      "time": "5 PM PDT",
      "locations": [
        "METROPOLITAN A"
      ],
      "tracks": [
        "Mixers/Receptions"
      ]
    },
    {
      "id": 31496815,
      "name": "California chapters AAJA convention mixer",
      "description": "<p>Inviting all California AAJA members from the SF Bay Area, Sacramento, LA, &amp; San Diego chapters attending the #AAJA25 convention!  Join us for a social mixer at the Elephant &amp; Castle pub’s Billiard Room, just one block from the convention hotel. Stop by to meet up with old friends and make new California connections. We’ll provide snacks and appetizers. Buy your own brews or other beverages with their Happy Hour discount. RSVP is not required, but event is for CA convention attendees.</p>",
      "start_time": "2025-08-01T00:00:00.000000+0000",
      "day": "Thu 7/31",
      "time": "5 PM PDT",
      "locations": [
        "Other"
      ],
      "tracks": [
        "Mixers/Receptions"
      ]
    },
    {
      "id": 31519943,
      "name": "Northeast chapters mixer (DC, New England, NY and Philly )",
      "description": "<p>Join us for our annual convention mixer with DC, NY, Philly &amp; New England chapters!</p>\n<br>\n<p><a href=\"https://flsseattle.org/\">Friends of Little Saigon Community Center,</a> 1227 S. Weller St. Suite A Seattle, WA 98144.</p>",
      "start_time": "2025-08-01T00:00:00.000000+0000",
      "day": "Thu 7/31",
      "time": "5 PM PDT",
      "locations": [
        "Other"
      ],
      "tracks": [
        "Mixers/Receptions"
      ]
    },
    {
      "id": 31524870,
      "name": "Funny, fierce and flipping the script with NBCU’s “St. Denis Medical” and “The Paper”",
      "description": "<p>Join the NBCU cast and creatives from NBC’s <em>St. Denis Medical</em> and Peacock’s <em>The Paper</em> as they talk about how they’re challenging outdated tropes and creating fresh, authentic portrayals of Asian women in comedy today. Moderated by MSNBC’s Yasmin Vossoughian, the panel will feature <em>St. Denis Medical</em> executive producer Vicky Luu and star Kahyun Kim, alongside <em>The Paper</em> series regular Ramona Young. <em>St. Denis Medical</em> and <em>The Paper</em> are both produced by Universal Studio Group.</p>",
      "start_time": "2025-08-01T00:00:00.000000+0000",
      "day": "Thu 7/31",
      "time": "5 PM PDT",
      "locations": [
        "WILLOW"
      ],
      "tracks": [
        "Community"
      ]
    },
    {
      "id": 31539916,
      "name": "Washington Post reception",
      "description": "<p>Details to follow</p>",
      "start_time": "2025-08-01T00:30:00.000000+0000",
      "day": "Thu 7/31",
      "time": "5:30 PM PDT",
      "locations": [
        "Other"
      ],
      "tracks": [
        "Mixers/Receptions"
      ]
    },
    {
      "id": 31496816,
      "name": "Freelance, photo and video AGs ASEAN StrEAT food mixer",
      "description": "<p>Come join us as we sample the diverse dishes of ASEAN StrEAT Food Hall, reminiscent of the food you'd find on the streets of Bangkok, Saigon, Singapore and Hong Kong, but with a Pacific Northwest vibe.</p>",
      "start_time": "2025-08-01T01:00:00.000000+0000",
      "day": "Thu 7/31",
      "time": "6 PM PDT",
      "locations": [
        "Other"
      ],
      "tracks": [
        "Mixers/Receptions"
      ]
    },
    {
      "id": 31496817,
      "name": "Seattle chapter 40th anniversary reception",
      "description": "<p>Join us as we celebrate the 40th anniversary of the AAJA Seattle Chapter! Enjoy food from Ballard Mandarin and mix and mingle with our Seattle chapter family. Access to Wing Luke Museum exhibits is included. Based in the heart of Seattle&#x27;s Chinatown International District, Wing Luke is the nation&#x27;s only pan-Asian Pacific American community based museum in the U.S. </p>\n<br>\n<p><strong>RSVP before July 29, 2025, required:</strong> <a href=\"https://www.eventbrite.com/e/aaja-seattle-40th-anniversary-convention-reception-tickets-1417704214469?utm-campaign=social&amp;utm-content=attendeeshare&amp;utm-medium=discovery&amp;utm-term=listing&amp;utm-source=cp&amp;aff=ebdsshcopyurl\">https://www.eventbrite.com/e/aaja-seattle-40th-anniversary-convention-reception-tickets-1417704214469?utm-campaign=social&amp;utm-content=attendeeshare&amp;utm-medium=discovery&amp;utm-term=listing&amp;utm-source=cp&amp;aff=ebdsshcopyurl</a></p>",
      "start_time": "2025-08-01T01:00:00.000000+0000",
      "day": "Thu 7/31",
      "time": "6 PM PDT",
      "locations": [
        "Other"
      ],
      "tracks": [
        "Mixers/Receptions"
      ]
    },
    {
      "id": 31496835,
      "name": "AAJA sports Korean barbecue",
      "description": "<p>Join our partners at CBS Sports, ESPN, The Athletic &amp; NFL Network for our annual Korean Barbecue, one of our most popular events of the year! </p>\n<br>\n<p>Limited spots available. RSVP required: <a href=\"https://www.eventbrite.com/e/aaja-sports-korean-barbecue-tickets-1422097414649?aff=oddtdtcreator\">https://www.eventbrite.com/e/aaja-sports-korean-barbecue-tickets-1422097414649?aff=oddtdtcreator</a></p>",
      "start_time": "2025-08-01T02:00:00.000000+0000",
      "day": "Thu 7/31",
      "time": "7 PM PDT",
      "locations": [
        "Other"
      ],
      "tracks": [
        "Mixers/Receptions"
      ]
    },
    {
      "id": 31496818,
      "name": "AAJA group run",
      "description": "<p>Join fellow convention-goers for a casual group run in Seattle! We'll meet in the hotel lobby at 7:00 AM and head out for a 2-4 mile run to explore the city together. All paces welcome - this is about connecting with fellow AAJA members and seeing Seattle, not setting records. Don't forget your running shoes!</p>",
      "start_time": "2025-08-01T14:00:00.000000+0000",
      "day": "Fri 8/1",
      "time": "7 AM PDT",
      "locations": [
        "Other"
      ],
      "tracks": [
        "Mixers/Receptions"
      ]
    },
    {
      "id": 31496819,
      "name": "Covering LGBTQ+ and trans policies",
      "description": "<p>As LGBTQ+ rights face mounting attacks across the country, institutions such as schools, hospitals, libraries and courts are increasingly at the center of this struggle. This roundtable will explore how journalists can hold institutions accountable while reporting on both the erosion of rights and the efforts to defend and expand them. Panelists will discuss how to find these stories, navigate sensitive coverage with care and build trust with LGBTQ+ communities in the process.</p>",
      "start_time": "2025-08-01T16:00:00.000000+0000",
      "day": "Fri 8/1",
      "time": "9 AM PDT",
      "locations": [
        "CEDAR"
      ],
      "tracks": [
        "Community"
      ]
    },
    {
      "id": 31496820,
      "name": "EXPO",
      "description": "<p>The AAJA25 Expo is your gateway to career opportunities, industry insights, and meaningful connections. Whether you&#x27;re seeking interviews, exploring job openings, or simply curious about different media companies, the Expo is the place to be.</p>\n<br>\n<p>Meet with recruiters from top news organizations, learn what they’re looking for, and gain a deeper understanding of newsroom culture and hiring practices. Whether you&#x27;re just starting out or looking to make your next move, the Expo offers valuable face time with industry leaders and a chance to take the next step in your journalism journey.</p>",
      "start_time": "2025-08-01T16:00:00.000000+0000",
      "day": "Fri 8/1",
      "time": "9 AM PDT",
      "locations": [
        "GRAND BALLROOM"
      ],
      "tracks": []
    },
    {
      "id": 31534905,
      "name": "So you want to be a food writer?",
      "description": "<p>This panel will look at how to successfully cover food – one of the most lucrative topics for many media organizations – at every level: national, local and as an individual contributor. We’ll look at how the coverage of AANHPI food has evolved over the years, how social media has changed the game for good, and how you can break in.</p>",
      "start_time": "2025-08-01T16:00:00.000000+0000",
      "day": "Fri 8/1",
      "time": "9 AM PDT",
      "locations": [
        "METROPOLITAN A"
      ],
      "tracks": [
        "Community",
        "Training"
      ]
    },
    {
      "id": 31534907,
      "name": "Covering and Engaging Pacific Islanders",
      "description": "<p>Pacific Islanders are the &quot;PI&quot; afterthought in &quot;AANHPI.&quot; Learn from journalists and PI advocates on their success stories of including Pacific Islanders in reporting, storytelling, data, and policy. From the halls of Congress to social platforms to newsrooms, speakers will share strategies on persuading and making the case for coverage of and engagement of NHPIs and growing AANHPI audiences and storytelling.</p>",
      "start_time": "2025-08-01T16:00:00.000000+0000",
      "day": "Fri 8/1",
      "time": "9 AM PDT",
      "locations": [
        "METROPOLITAN B"
      ],
      "tracks": [
        "Community"
      ]
    },
    {
      "id": 31536800,
      "name": "Turning clicks into credibility: Growing a social media presence that opens doors (Presented by AAJA Sports Task Force)",
      "description": "<p>Your social media presence can be more than just a creative outlet — it can be a career asset. In this panel, top media professionals and content creators share how they’ve built meaningful followings across platforms — and how you can too. Learn platform-specific strategies, what makes content resonate, and how to turn your online presence into a tool that supports your professional goals, from job interviews to brand partnerships.</p>",
      "start_time": "2025-08-01T16:00:00.000000+0000",
      "day": "Fri 8/1",
      "time": "9 AM PDT",
      "locations": [
        "REDWOOD"
      ],
      "tracks": [
        "Innovation",
        "Training"
      ]
    },
    {
      "id": 31496823,
      "name": "The power of the pitch - Professionally and personally (Presented by CBS News and Stations)",
      "description": "<p>From producers to reporters, this session will provide journalists with tips and techniques for interviewing and creative storytelling to craft effective pitches. Also explored will be the challenges of making the transition from producing at the local level to the network and pitching national stories. Experienced journalists will share ways to reach the network level and discuss the role of cultivating relationships and cultural factors that may influence career progression for mid-level and veteran journalists.</p>",
      "start_time": "2025-08-01T17:30:00.000000+0000",
      "day": "Fri 8/1",
      "time": "10:30 AM PDT",
      "locations": [
        "CEDAR"
      ],
      "tracks": [
        "Training"
      ]
    },
    {
      "id": 31496824,
      "name": "A conversation with Dr. Bobby Mukkamala: The AMA’s new president on medicine, policy and personal experience (Presented by the American Medical Association)",
      "description": "<p>Dr. Bobby Mukkamala was recently sworn in as president of the American Medical Association, becoming the first South Asian physician to hold the role. In this 1:1 fireside chat, we’ll discuss his work as a doctor in Flint, Michigan — a city shaped by environmental and health inequities — and his recent experience as a brain cancer patient and how that has influenced his approach to care. The conversation will also cover how the AMA is navigating the current political landscape, including changes at the Department of Health and Human Services and evolving vaccine and public health guidance. This session offers context and perspective for journalists covering health, policy and the role of medical leadership.</p>",
      "start_time": "2025-08-01T17:30:00.000000+0000",
      "day": "Fri 8/1",
      "time": "10:30 AM PDT",
      "locations": [
        "METROPOLITAN A"
      ],
      "tracks": [
        "Leadership",
        "Community"
      ]
    },
    {
      "id": 31496825,
      "name": "What journalists can learn from content creators",
      "description": "<p>How did TikTokkers take an innovative video platform and make it their own? How are YouTube journalists making a living and hooking a notoriously fickle digital audience? Why do your Instagram Reels struggle to go viral? Learn the fundamentals of vertical video, streaming and YouTube journalism best practices to take your content from languishing on digital to breaking through the noise. Attendees will get insight on analytics, production techniques and making your newsroom relevant in a vertical video future.</p>",
      "start_time": "2025-08-01T17:30:00.000000+0000",
      "day": "Fri 8/1",
      "time": "10:30 AM PDT",
      "locations": [
        "WILLOW"
      ],
      "tracks": [
        "Innovation",
        "Training"
      ]
    },
    {
      "id": 31515829,
      "name": "Organizing and empowering your newsroom (Presented by SAG-AFTRA)",
      "description": "<p>Join SAG-AFTRA for a discussion on addressing issues, advocating for solutions, and cultivating relationships in your newsroom. <br> <br>Panelists will discuss how they have experienced and utilized union organizing and advocacy at their companies. Topics covered will include forming a new union, collective bargaining, developing leadership and more. The perspectives shared will provide a firsthand view of how having a union in your newsroom can be a vehicle for providing solutions and making improvements on the job. Note: This discussion will be off record.</p>",
      "start_time": "2025-08-01T17:30:00.000000+0000",
      "day": "Fri 8/1",
      "time": "10:30 AM PDT",
      "locations": [
        "METROPOLITAN B"
      ],
      "tracks": [
        "Leadership",
        "Training"
      ]
    },
    {
      "id": 31522688,
      "name": "We got NOW: Navigating the women’s sports boom (Presented by AAJA Sports Task Force)",
      "description": "<p>With the WNBA and NWSL expanding, franchise valuations skyrocketing, and stars like Caitlin Clark capturing national attention, women’s sports are no longer a niche — they’re a movement. This panel explores the best practices and challenges in covering leagues that are rapidly growing and attracting new audiences. What should journalists know when stepping into this evolving space? And what new opportunities await those ready to lead the coverage of women’s sports in this pivotal moment?</p>",
      "start_time": "2025-08-01T17:30:00.000000+0000",
      "day": "Fri 8/1",
      "time": "10:30 AM PDT",
      "locations": [
        "REDWOOD"
      ],
      "tracks": [
        "Innovation",
        "Training"
      ]
    },
    {
      "id": 31496826,
      "name": "Covering race and equity in the Trump era",
      "description": "<p>As diversity, equity and inclusion efforts face increasing backlash, reporting on these topics has become more fraught — yet essential. Hear from journalists on the front lines of this critical coverage as they discuss how to navigate internal newsroom resistance, community skepticism and political pressure while striving to tell stories with accuracy, depth and compassion. Learn how they build trust with communities, as well as push for meaningful, responsible journalism in an era of heightened division.</p>",
      "start_time": "2025-08-01T20:00:00.000000+0000",
      "day": "Fri 8/1",
      "time": "1 PM PDT",
      "locations": [
        "CEDAR"
      ],
      "tracks": [
        "Community"
      ]
    },
    {
      "id": 31496827,
      "name": "Journalism under attack: Lessons from other nations",
      "description": "<p>Press freedom in the United States is under threat. The First Amendment is under attack, and shrinking resources means newsrooms may struggle to support journalism and hold power to account. As the U.S. media grapples with this unprecedented reality, we speak to reporters and editors from around the world who have faced similar attacks on press freedom. From navigating legal crackdowns, arrests, online threats and harassment, journalists share their experiences, resources and tips on surviving these testing times. </p>",
      "start_time": "2025-08-01T20:00:00.000000+0000",
      "day": "Fri 8/1",
      "time": "1 PM PDT",
      "locations": [
        "METROPOLITAN B"
      ],
      "tracks": [
        "Community"
      ]
    },
    {
      "id": 31496828,
      "name": "Can you survive a night shift? Making it through the crazy hours of early career media (Presented by TNT Sports Interactive)",
      "description": "<p>You did it! You got your first media job. There’s only one problem: your shift hours are from 8 p.m.-4 a.m. on the breaking news desk. Welcome to the night shift. Almost all new media hires will inevitably be scheduled to work hours outside the typical 9 a.m.-5 p.m. work window.  Whether you’re covering sports, politics or entertainment, the news cycle never sleeps. So, how are you going to survive?  During this interactive session, you’ll hear from three veterans who have worked in editorial, design and social media at TNT Sports and Bleacher Report. They will help you navigate these new gigs by sharing stories of how to manage the workload during the actual shifts, balance your life during your non-work daytime hours and what to expect in your first few years on the job.  We’ll also put the audience to the test and simulate some common scenarios during night shifts to see if attendees can truly survive a night shift. </p>",
      "start_time": "2025-08-01T20:00:00.000000+0000",
      "day": "Fri 8/1",
      "time": "1 PM PDT",
      "locations": [
        "REDWOOD"
      ],
      "tracks": [
        "Training"
      ]
    },
    {
      "id": 31496829,
      "name": "Being your own editor and CEO: Tips for creating your own media business",
      "description": "<p>This session will be your solo media entrepreneurship survival guide. Hear from people who carved out their news niche, expanded successful freelance careers and built their own businesses. Get top tips on building an effective social media strategy, monetizing sustainable news products and maintaining editorial independence in the new journalism landscape. </p>",
      "start_time": "2025-08-01T20:00:00.000000+0000",
      "day": "Fri 8/1",
      "time": "1 PM PDT",
      "locations": [
        "WILLOW"
      ],
      "tracks": [
        "Leadership",
        "Training"
      ]
    },
    {
      "id": 31535475,
      "name": "Publishing power: Sally Kim and Curtis Chin on leading, storytelling and opening doors (Presented by Hachette Book Group)",
      "description": "<p>Join us for a candid fireside conversation with Sally Kim, president and publisher of Little, Brown and Co. at Hachette Book Group — and the first Asian American to lead a major U.S. publishing imprint — and Curtis Chin, award-winning memoirist, filmmaker and co-founder of the Asian American Writers’ Workshop. As the publishing industry faces rapid shifts in 2025, from digital disruption to evolving reader expectations, these two trailblazers offer rare insight into shaping literary culture from both sides of the page — editorial and authorial. <br>  <br> Moderated by NBC News senior correspondent Vicky Nguyen, the conversation will explore Kim’s rise through the publishing ranks, Chin’s journey from Detroit’s Chinatown to the national bestseller list, and how both navigate risk, representation and innovation in a legacy-driven field. Together, they’ll reflect on what it means to open doors for underrepresented voices, lead with clarity and vision, and use storytelling as a tool for cultural impact.</p>",
      "start_time": "2025-08-01T20:00:00.000000+0000",
      "day": "Fri 8/1",
      "time": "1 PM PDT",
      "locations": [
        "ASPEN"
      ],
      "tracks": [
        "Leadership"
      ]
    },
    {
      "id": 31496830,
      "name": "Rooted in community: Lessons from local news founders (Presented by Press Forward)",
      "description": "<p>What drives someone to launch a local news outlet serving Asian American communities — and what does it take to keep it going? Join a candid conversation with community media founders who have built newsrooms from the ground up. They’ll share what inspired them to start, the unique challenges they’ve faced, the skills they’ve had to learn on the fly and how their mission has evolved over time.</p>",
      "start_time": "2025-08-01T21:30:00.000000+0000",
      "day": "Fri 8/1",
      "time": "2:30 PM PDT",
      "locations": [
        "CEDAR"
      ],
      "tracks": [
        "Leadership",
        "Community"
      ]
    },
    {
      "id": 31496831,
      "name": "Covering climate: Intersectional reporting, debunking misinformation and combating attacks on science",
      "description": "<p>The threats and impact of our fast warming globe go beyond higher temperatures. They intersect with global issues like migration, the global economy, human rights and war. In this panel, journalists talk about the increasing need to report on the climate crisis in the context of global forces — and the challenges of doing so amid shrinking newsrooms and the onslaught of attacks on science. The threats and impact of our fast warming globe go beyond higher temperatures. They intersect with global issues like migration, the global economy, human rights and war. In this panel, journalists talk about the increasing need to report on the climate crisis in the context of global forces — and the challenges of doing so amid shrinking newsrooms and the onslaught of attacks on science. What are the big forces shaping the climate crisis, and how can reporters find climate angles to breaking stories? How can journalists cut through misinformation amid growing political attacks on science, while keeping audiences informed and engaged?</p>",
      "start_time": "2025-08-01T21:30:00.000000+0000",
      "day": "Fri 8/1",
      "time": "2:30 PM PDT",
      "locations": [
        "METROPOLITAN B"
      ],
      "tracks": [
        "Community"
      ]
    },
    {
      "id": 31496832,
      "name": "Surviving and thriving when journalism throws you for a loop",
      "description": "<p>Did you just get laid off? Are you ready to take the leap from journalism to a different career? Or are you just wondering how your skills might transfer to another industry? If you answered yes to any of these questions, this hands-on session is for you. We’ll give you tips on navigating a career shift, how to exit a company on your terms and other industries where your skills may translate well. You’ll hear from journalists who have sage advice on making a career shift, and also get a chance to break into small groups to discuss personal experiences with other convention attendees. Don’t forget to bring your resume!</p>",
      "start_time": "2025-08-01T21:30:00.000000+0000",
      "day": "Fri 8/1",
      "time": "2:30 PM PDT",
      "locations": [
        "WILLOW"
      ],
      "tracks": [
        "Leadership",
        "Training"
      ]
    },
    {
      "id": 31515830,
      "name": "The disturbing data behind AAPI underrepresentation in journalism: New studies and strategies that address US perceptions and the talent pipeline (Presented by AARP)",
      "description": "<p>This panel and the research it presents confront the hidden stereotypes driving the persistent underrepresentation of AAPIs in news. For the first time, it will unveil significant and unsettling data regarding AAPI underrepresentation in news, particularly in broadcast media, as revealed through pioneering research by the Asian American Journalists Association. This session is also the official release of two precedent-setting AAJA studies: US Perceptions of AAPIs in News, and AAPI News Talent Pipeline Study. The discussion highlights practical actions news directors and community leaders can implement to enhance AAPI representation in the news industry. Participants will learn key findings from this groundbreaking research and action-based strategies to resolve the contributing factors to underrepresentation that these studies confirmed or revealed. These studies were underwritten by AARP, NORC, and PRISCA, led by the AAJA Broadcast Task Force, including advisory board members Alex Chew, Director at NORC, and Karthick Ramakrishnan, Executive Director at AAPI Data.</p>",
      "start_time": "2025-08-01T21:30:00.000000+0000",
      "day": "Fri 8/1",
      "time": "2:30 PM PDT",
      "locations": [
        "ASPEN"
      ],
      "tracks": [
        "Training"
      ]
    },
    {
      "id": 31522690,
      "name": "Reporting on educational equity within the AANHPI Community (Presented by the National Education Association)",
      "description": "<p>Amid national debates over affirmative action and DEI in education, the AANHPI community can often find itself at the center of complex and sometimes contradictory narratives. Further, the “model minority” myth masks the significant disparities and barriers faced by many AANHPI subgroups, particularly those from limited English proficient, immigrant, refugee and low-income backgrounds. This panel will explore how journalists can more accurately report on issues of educational equity within AANHPI communities, highlighting the diverse experiences that shape access to education for AANHPI students. </p>",
      "start_time": "2025-08-01T21:30:00.000000+0000",
      "day": "Fri 8/1",
      "time": "2:30 PM PDT",
      "locations": [
        "REDWOOD"
      ],
      "tracks": [
        "Community",
        "Training"
      ]
    },
    {
      "id": 31523470,
      "name": "The evolving newsroom: Navigating principles and purpose in the age of AI and streaming (Presented by FOX)",
      "description": "<p>This panel brings together executive producers and content leaders to discuss how core journalistic principles—such as accuracy, fairness, independence and accountability—are being upheld and adapted in modern newsrooms. The conversation will explore the impact of AI integration, evolving skill sets, the role of crowdsourcing and the growing influence of streaming on content delivery and audience engagement.</p>",
      "start_time": "2025-08-01T21:30:00.000000+0000",
      "day": "Fri 8/1",
      "time": "2:30 PM PDT",
      "locations": [
        "METROPOLITAN A"
      ],
      "tracks": [
        "Innovation"
      ]
    },
    {
      "id": 31496833,
      "name": "Walking the digital beat: Finding sources online and on social",
      "description": "<p>Tired of calling the local town gossip to find news stories and sources? Think LinkedIn is just a bunch of AI bros talking past each other? Learn how to trawl the internet to speed up your digital sourcing by setting up Google alerts, combing Reddit and pulling data in efficient ways. You’ll walk away seeing reputable social networks and tools in totally new ways. </p>",
      "start_time": "2025-08-01T23:00:00.000000+0000",
      "day": "Fri 8/1",
      "time": "4 PM PDT",
      "locations": [
        "METROPOLITAN B"
      ],
      "tracks": [
        "Innovation",
        "Training"
      ]
    },
    {
      "id": 31515831,
      "name": "Search is dead. News isn’t — if we evolve quickly (Presented by AP)",
      "description": "<p>Search won’t save us. Attention is splintered. Platforms are unreliable. And AI isn’t just the next thing — it’s the new baseline. So how do we stop playing catch-up and start leading? <br> This session makes the case for a radical editorial rethink. If your newsroom is still optimizing for yesterday’s platforms or stuck in legacy formats, it’s time to evolve — or risk irrelevance. <br> We’ll share what the AP is trying, what’s working, and what still confuses us. But we want to hear from you, too. What’s flopped? What’s clicked? Let’s trade ideas, surface what’s useful, and shape what’s next — together. </p>",
      "start_time": "2025-08-01T23:00:00.000000+0000",
      "day": "Fri 8/1",
      "time": "4 PM PDT",
      "locations": [
        "CEDAR"
      ],
      "tracks": [
        "Leadership",
        "Training"
      ]
    },
    {
      "id": 31522691,
      "name": "Bylines to book covers: AAPI journalists on the path to publishing",
      "description": "<p>For many AAPI journalists, the leap from newsroom deadlines to book publishing can feel both exhilarating and daunting. How do you translate reporting skills into longform storytelling — whether memoir, nonfiction, or fiction — and navigate an industry that still lacks diverse representation? This panel offers a 360-degree view of the journalist-to-author journey, centering the unique experiences of Asian American voices.</p>\n<p>Hear from Sally Kim, the first Asian American publisher at a major publishing house; Sara Kehaulani Goo, a newsroom leader and nonfiction author; novelist and journalist Parul Kapur; and literary agent Howard Yoon, who has helped shape numerous authorial careers. Moderated by Katherine Reynolds Lewis, author and founder of the Institute for Independent Journalists, the conversation will explore creative pivots, industry insights, and the power of Asian American storytelling in shaping both media and literature.</p>",
      "start_time": "2025-08-01T23:00:00.000000+0000",
      "day": "Fri 8/1",
      "time": "4 PM PDT",
      "locations": [
        "WILLOW"
      ],
      "tracks": [
        "Training"
      ]
    },
    {
      "id": 31535476,
      "name": "Counting in: How journalists can bridge the AAPI census gap",
      "description": "<p>The next U.S. Census will take place in 2030, shaping the nation’s political representation, funding distribution and public policy for the next decade. Yet AAPI communities have historically been undercounted due to language barriers, mistrust of government, complex multigenerational households and lack of outreach. Smaller AAPI subgroups are especially at risk of being overlooked, leading to hidden disparities in resources for education, health and social services. <br> In this session, leaders at the forefront of Census outreach to AAPI communities discuss how accurate data can better reflect AAPI communities — and how newsrooms can help monitor progress towards Census 2030.</p>",
      "start_time": "2025-08-01T23:00:00.000000+0000",
      "day": "Fri 8/1",
      "time": "4 PM PDT",
      "locations": [
        "METROPOLITAN A"
      ],
      "tracks": [
        "Community",
        "Training"
      ]
    },
    {
      "id": 31496834,
      "name": "AAJA Portland happy hour",
      "description": "<p>All are welcome to come hang with AAJA PDX at Rachel's Ginger Beer in Pike Place Market!</p>",
      "start_time": "2025-08-02T00:00:00.000000+0000",
      "day": "Fri 8/1",
      "time": "5 PM PDT",
      "locations": [
        "Other"
      ],
      "tracks": [
        "Mixers/Receptions"
      ]
    },
    {
      "id": 31497350,
      "name": "AP reception",
      "description": "<p>Meet newsroom leaders, reporters, editors, producers and visual journalists at a reception hosted by The Associated Press, an independent global news organization dedicated to factual reporting. Founded in 1846, AP remains the most trusted source of fast, accurate, unbiased news and an essential provider of the technology vital to the industry. More than half the world&#x27;s population sees AP journalism every day.</p>",
      "start_time": "2025-08-02T00:30:00.000000+0000",
      "day": "Fri 8/1",
      "time": "5:30 PM PDT",
      "locations": [
        "REDWOOD"
      ],
      "tracks": [
        "Mixers/Receptions"
      ]
    },
    {
      "id": 31541311,
      "name": "Seattle chapter tours: Tour of KING 5's Newsroom",
      "description": "<p><strong>Date</strong>: Friday, Aug. 1 from 5:30 to 6:30 p.m.</p>\n<p><strong>Cost</strong>: FREE</p>\n<p><strong>Description</strong>: Ever wondered what it takes to bring the news to your screens? Now’s your chance to find out! Join us for an exclusive behind-the-scenes tour of the KING 5 Newsroom, Seattle’s trusted source for news, weather, and sports. This hour-long tour will take you inside the fast-paced world of multiplatform journalism. Space is limited to just 20 participants, so don’t wait—reserve your spot today!</p>\n<p>**Your spot is NOT confirmed until a confirmation email is sent back to you.</p>\n<p><strong>Link</strong>: <u><a href=\"https://forms.gle/7nBjPcereFTZdKoM6\">https://forms.gle/7nBjPcereFTZdKoM6</a></u></p>",
      "start_time": "2025-08-02T00:30:00.000000+0000",
      "day": "Fri 8/1",
      "time": "5:30 PM PDT",
      "locations": [
        "Other"
      ],
      "tracks": [
        "Mixers/Receptions"
      ]
    },
    {
      "id": 31516854,
      "name": "Invigorating alternative news media with Noisy Creek",
      "description": "<p>Join Noisy Creek founder and CEO Brady Walkinshaw for an evening of drinks, snacks, and a celebration of local media. Located at Noisy Creek&#x27;s new offices on Capitol Hill, this reception is at the heart of Seattle&#x27;s journalistic and cultural intersections. <br><br>Founded in 2024, Noisy Creek publishes two iconic newspapers: The Stranger in Seattle, and the Portland Mercury. The Stranger and Mercury have served as vital voices of their cities for decades, breaking news, defining culture, and winning awards, including The Stranger&#x27;s 2012 Pulitzer Prize. <br><br>In addition to their editorial products, Noisy Creek operates EverOut, the event discovery site, and Bold Type Tickets, a national ticketing platform. With growing newsrooms and a unique mix of digital and print products, Noisy Creek is designing a new model for invigorating local media.</p>",
      "start_time": "2025-08-02T01:00:00.000000+0000",
      "day": "Fri 8/1",
      "time": "6 PM PDT",
      "locations": [
        "Other"
      ],
      "tracks": [
        "Mixers/Receptions"
      ]
    },
    {
      "id": 31496836,
      "name": "AAJA STF: Summer Jam 2025",
      "description": "<p>STF and our sponsors, CBS Sport and ESPN, cordially invited you for a fun evening of games, refreshing drinks and networking with industry leaders. </p>\n<br>\n<p><strong>Tickets are limited!</strong> <a href=\"https://www.eventbrite.com/e/aaja-sports-summer-jam-2025-tickets-1425310394759?aff=oddtdtcreator\">https://www.eventbrite.com/e/aaja-sports-summer-jam-2025-tickets-1425310394759?aff=oddtdtcreator</a></p>",
      "start_time": "2025-08-02T02:00:00.000000+0000",
      "day": "Fri 8/1",
      "time": "7 PM PDT",
      "locations": [
        "Other"
      ],
      "tracks": [
        "Mixers/Receptions"
      ]
    },
    {
      "id": 31496837,
      "name": "AAJA Chicago meet-up",
      "description": "<p>We&#x27;re planning to gather for a Chicago chapter meet-up Friday evening, 7 PM, at Yard House — just a 5-minute walk from the Sheraton Grand Seattle. Stop by for a casual dinner or just to hang out! (It&#x27;s pay-on-your-own, and food is available to purchase at the restaurant.) If you&#x27;d like us to send you a calendar invite with details and day-of contact information, email AAJA Chicago Events Director Casey Mendoza (<a href=\"mailto:cnmdoza@gmail.com\">cnmdoza@gmail.com</a>)</p>",
      "start_time": "2025-08-02T02:00:00.000000+0000",
      "day": "Fri 8/1",
      "time": "7 PM PDT",
      "locations": [
        "Other"
      ],
      "tracks": [
        "Mixers/Receptions"
      ]
    },
    {
      "id": 31541308,
      "name": "Seattle chapter activities: Seattle Mariners game",
      "description": "<p><strong>Date</strong>: Friday, Aug. 1 at 7:10 p.m.</p>\n<p><strong>Cost</strong>: $28 per ticket</p>\n<p><strong>Where</strong>: T-Mobile Park</p>\n<p><strong>Description</strong>: Come watch the Seattle Mariners at T-Mobile Park and earn your sea legs with the team. Hang out with home run derby champion Cal “Big Dumper” Raleigh or enter the no fly zone with Julio Rodríguez. Stay after the game to enjoy a dazzling fireworks display set to your favorite showtunes. It’ll be a grand slam of a night.</p>\n<p><strong>Payment</strong>: If you’d like to reserve a spot with AAJA’s group rate and sit with your Convention buddies, please Venmo AAJA Seattle (@aajaseattle) by <strong>July 25th</strong>. You <strong><u>MUST</u> </strong>include your name in the description of the Venmo that matches your registration.<br>**Your spot is NOT confirmed until payment is received and a confirmation email is sent back to you.</p>\n<p><strong>Link</strong>: <u><a href=\"https://forms.gle/bKqNhvLsF6HG21Z19\">https://forms.gle/bKqNhvLsF6HG21Z19</a></u></p>",
      "start_time": "2025-08-02T02:00:00.000000+0000",
      "day": "Fri 8/1",
      "time": "7 PM PDT",
      "locations": [
        "Other"
      ],
      "tracks": [
        "Mixers/Receptions"
      ]
    },
    {
      "id": 31541309,
      "name": "Seattle chapter activities: Seattle Storm game",
      "description": "<p><strong>Date</strong>: Friday, Aug. 1 at 7 p.m.</p>\n<p><strong>Cost</strong>: $41 per ticket</p>\n<p><strong>Where</strong>: Climate Pledge Arena</p>\n<p><strong>Description</strong>: Join the Seattle Storm and help cheer on the city’s 4x WNBA championship team, as they take on the Los Angeles Sparks. Tickets include a $25 food and beverage voucher, redeemable at any of the many vendors at the one-and-only Climate Pledge Arena. Nachos! Beer! Burgers! Even dumplings! And above all else, a great night of basketball.</p>\n<p><strong>Payment</strong>: If you’d like to reserve a spot with AAJA’s group rate and sit with your Convention buddies, please Venmo AAJA Seattle (@aajaseattle) by <strong>July 25th</strong>. You <strong><u>MUST</u> </strong>include your name in the description of the Venmo that matches your registration.<br>**Your spot is NOT confirmed until payment is received and a confirmation email is sent back to you.</p>\n<p><strong>Link</strong>: <u><a href=\"https://forms.gle/37xgkn3KPi81ESDH9\">https://forms.gle/37xgkn3KPi81ESDH9</a></u></p>",
      "start_time": "2025-08-02T02:00:00.000000+0000",
      "day": "Fri 8/1",
      "time": "7 PM PDT",
      "locations": [
        "Other"
      ],
      "tracks": [
        "Mixers/Receptions"
      ]
    },
    {
      "id": 31496838,
      "name": "Uncovering the numbers: Navigating gun violence data in AAPI communities (Presented by GIFFORDS)",
      "description": "<p>Mass shootings in Atlanta, Monterey Park, and Half Moon Bay have brought gun violence to the forefront among AAPIs. Still, beyond these high-profile tragedies, firearm-related deaths — especially suicides — are rising in Asian American and Pacific Islander communities. Accurately reporting on this crisis requires data, but journalists and advocates often face gaps and limitations in what information is available. This hands-on workshop will guide attendees through the complex landscape of gun violence mortality data. Participants will get an overview of key data sources and a tutorial on using CDC WONDER (Wide-Ranging ONline Data for Epidemiologic Research), a federal mortality database. We’ll explore both the strengths and shortcomings of this tool — particularly its limited disaggregated AAPI data — and discuss strategies to bridge these gaps in storytelling and advocacy.</p>",
      "start_time": "2025-08-02T16:00:00.000000+0000",
      "day": "Sat 8/2",
      "time": "9 AM PDT",
      "locations": [
        "CEDAR"
      ],
      "tracks": [
        "Community",
        "Training"
      ]
    },
    {
      "id": 31514466,
      "name": "Identifying – and avoiding – anti-queer and anti-trans bias in the newsroom (Presented by AAJA’s LGBTQIA+ Affinity Group)",
      "description": "<p>In the current political climate, the LGBTQ+ community – trans people especially – have been consistently targeted by far-right activists and politicians. As journalists, it’s our responsibility to cover these communities fairly and accurately. <br> How can everyone identify potential transphobia or homophobia in newsroom coverage? What are common misconceptions and myths that may intentionally or unintentionally dehumanize transgender and gender-nonconforming people? How can queer people in the newsroom navigate issues of representation when being “out” can make them doubly vulnerable as journalists – and how can their colleagues and managers support them? <br> This panel will be a candid conversation among LGBTQ+ journalists at all stages of their careers who will talk about how anti-queer and anti-trans bias can appear throughout assigning, reporting, writing, and editing stories…and how everyone can be empowered to help shift that. <br> </p>",
      "start_time": "2025-08-02T16:00:00.000000+0000",
      "day": "Sat 8/2",
      "time": "9 AM PDT",
      "locations": [
        "REDWOOD"
      ],
      "tracks": [
        "Community",
        "Training"
      ]
    },
    {
      "id": 31514469,
      "name": "Covering India and the diaspora in today's geopolitical climate",
      "description": "<p>India is the world’s most populous nation and fastest growing major economy, but it has largely been covered through a Western gaze, where its complexities are either oversimplified or ignored. How can we report on India and its vast diaspora fairly and accurately? From the role of tech in advancing majoritarian Hindu nationalism to the growing political clout of the diaspora in the U.S., journalists share their reporting experiences in India and the diaspora, challenges in pitching and covering a complex country for a U.S. audience, and how their identity has shaped their coverage of their community.</p>",
      "start_time": "2025-08-02T16:00:00.000000+0000",
      "day": "Sat 8/2",
      "time": "9 AM PDT",
      "locations": [
        "ASPEN"
      ],
      "tracks": [
        "Community"
      ]
    },
    {
      "id": 31522521,
      "name": "Coding help desk (Presented by News Nerds Affinity Group)",
      "description": "<p>Having trouble wrangling city hall data? Want to use Mapbox or Datawrapper in a story but don’t know where to start? Design issues? Or just curious about what data journalism looks like? Bring your laptop! This peer-to-peer, collaborative session is a chance to get hands-on help and support from fellow journalists as we share knowledge and tackle technical hurdles together. News Nerds members will do their best to help. </p>\n<br>\n<p><strong>All skill levels are welcome. </strong></p>\n<br>\n<p>Let’s level up our data storytelling skills together.</p>",
      "start_time": "2025-08-02T16:00:00.000000+0000",
      "day": "Sat 8/2",
      "time": "9 AM PDT",
      "locations": [
        "METROPOLITAN A"
      ],
      "tracks": [
        "Innovation",
        "Training"
      ]
    },
    {
      "id": 31531705,
      "name": "Annual AAJA Clothing Swap: Clean out your closet and refresh your look",
      "description": "<p>Clean out your closet and refresh your look at the <strong>annual AAJA Clothing Swap</strong>!</p>\n<br>\n<p>Bring your gently used professional clothing to the Associated Press booth (EXPO Hall) from Wednesday to Friday, then swing by room <strong>Metropolitan B</strong> on Saturday (9 AM–12 PM) to pick up something new-to-you.</p>\n<br>\n<p><strong>All genders welcome,</strong> and we encourage clothing for all gender expressions. All unclaimed clothing will be donated to a local charity after the event.</p>\n<p><br>We’re also looking for volunteers to help out during the swap on Saturday—let Corinne Chin or Jin Ding know if you’re interested in lending a hand!</p>",
      "start_time": "2025-08-02T16:00:00.000000+0000",
      "day": "Sat 8/2",
      "time": "9 AM PDT",
      "locations": [
        "METROPOLITAN B"
      ],
      "tracks": [
        "Mixers/Receptions"
      ]
    },
    {
      "id": 31535477,
      "name": "Asian women leading the newsroom in a defining era",
      "description": "<p>At a time when democracy, press freedom, and racial equity are under increasing pressure, leadership in newsrooms has never been more critical—or more visible. In this pivotal moment, as communities demand more inclusive, truthful, and nuanced coverage, Asian American women are stepping up to lead with clarity, care, and courage. Join Julia B. Chan (The 19th News), Terry Tang (Los Angeles Times), and Pam Chen (ABC7 Los Angeles) for an urgent and inspiring conversation on what it means to shape news coverage, newsroom culture, and public trust today. From combating bias to building belonging, these trailblazers are not just making space—they’re redefining leadership for the future of journalism.</p>",
      "start_time": "2025-08-02T16:00:00.000000+0000",
      "day": "Sat 8/2",
      "time": "9 AM PDT",
      "locations": [
        "WILLOW"
      ],
      "tracks": [
        "Leadership"
      ]
    },
    {
      "id": 31496839,
      "name": "International reporting: Challenges and opportunities",
      "description": "<p>Wars, realignment of the world order, climate disasters, the space race, tariffs and increasing globalization of culture — there’s never been a more important, exciting time to cover the world. Still, increased focus on U.S. domestic news, budget cuts in newsrooms and declining press freedom in many countries means newsrooms have fewer resources and editorial will to invest in international reporting. Journalists will talk about the changing face of international reporting, practical tips on freelancing and getting funded, and finding your unique perspective and voice on leading global news stories. </p>",
      "start_time": "2025-08-02T17:30:00.000000+0000",
      "day": "Sat 8/2",
      "time": "10:30 AM PDT",
      "locations": [
        "ASPEN"
      ],
      "tracks": [
        "Community"
      ]
    },
    {
      "id": 31514467,
      "name": "Visual Impact: Documenting your community with sensitivity and intent (Presented by Photo AG)",
      "description": "<p>Covering disasters or funerals is already a difficult assignment, but covering them in your own community adds another layer of complexity to sharing heart-wrenching stories of loss and the unknown of what the future holds. Capturing people visually at their lowest moment requires navigating the need to share the emotions of the story while respecting people’s personal space. Our panel of photographers will share their images and their experience covering emotionally charged assignments. </p>",
      "start_time": "2025-08-02T17:30:00.000000+0000",
      "day": "Sat 8/2",
      "time": "10:30 AM PDT",
      "locations": [
        "WILLOW"
      ],
      "tracks": [
        "Community",
        "Training"
      ]
    },
    {
      "id": 31535478,
      "name": "Journalism’s unexpected move: Turning AI from threat to triumph",
      "description": "<p>A roundtable on practical newsroom strategies to rethink how journalism can lead with AI <br>  <br> AI systems already leverage journalism’s content — without credit, compensation or commitment to newsroom values. We’ve seen this story before with classified ads and social platforms, but this time, the stakes are even higher. It’s about harnessing journalism’s market power in the economy and society. <br>  <br> This session brings together newsroom leaders, technologists and researchers for a candid, practical conversation about how journalism can shape the future of AI instead of just reacting to it. We’ll explore asymmetric strategies for protecting content, developing new products and building business models that serve both journalism’s mission and sustainability. <br>  <br> Whether you’re leading AI efforts, just starting to explore them or skeptical of the hype, you’ll find real-world takeaways. Walk away with operational questions to ask, ideas to test and management insights to improve your newsroom and excite your team.</p>",
      "start_time": "2025-08-02T17:30:00.000000+0000",
      "day": "Sat 8/2",
      "time": "10:30 AM PDT",
      "locations": [
        "REDWOOD"
      ],
      "tracks": [
        "Innovation"
      ]
    },
    {
      "id": 31535479,
      "name": "From headlines to Hollywood: Making the career transition from journalism to marketing (Presented by IW Group)",
      "description": "<p>Thinking about a career shift from journalism to marketing or communications? Join IW Group, a leading multicultural creative agency, for a conversation on how journalists can successfully pivot into brand strategy, public relations and entertainment marketing. With a client roster that includes nearly every major Hollywood studio, IW Group has led campaigns for titles like Crazy Rich Asians, Shōgun, Moana 2 and many more — not just for Asian American audiences, but for wide-reaching global releases. Panelists will share how core journalism skills — from storytelling and research to audience engagement — are highly transferable in the world of marketing and communications.</p>",
      "start_time": "2025-08-02T17:30:00.000000+0000",
      "day": "Sat 8/2",
      "time": "10:30 AM PDT",
      "locations": [
        "METROPOLITAN A"
      ],
      "tracks": [
        "Innovation",
        "Training"
      ]
    },
    {
      "id": 31540065,
      "name": "From presence to power: Asian American leaders shaping communities (Presented by the Council of Korean Americans)",
      "description": "<p>What does inclusive leadership look like in today’s America—and how are Asian American leaders stepping up to shape it? This session, presented by the Council of Korean Americans, brings together two dynamic changemakers at the forefront of public service and research. Sam Cho, Commissioner at the Port of Seattle, has broken barriers as a young Korean American leader championing equitable growth and civic engagement. Dr. Neil G. Ruiz, Associate Director at Pew Research Center, leads groundbreaking work on race, identity, and immigration that informs policy and public understanding. Guided by journalist Natasha Chen, this conversation will explore how Korean American and Asian American leaders are expanding access, lifting up marginalized voices, and building a more inclusive future—from local communities to the national stage.</p>",
      "start_time": "2025-08-02T17:30:00.000000+0000",
      "day": "Sat 8/2",
      "time": "10:30 AM PDT",
      "locations": [
        "CEDAR"
      ],
      "tracks": [
        "Leadership",
        "Community"
      ]
    },
    {
      "id": 31526358,
      "name": "ROSEMEAD (柔似蜜) screening (Presented by TAAF)",
      "description": "<p><strong>You’re invited to a private preview screening </strong>of<strong> Lucy Liu’s latest project, <u><a href=\"https://www.instagram.com/rosemeadfilm\">ROSEMEAD</a></u> (柔似蜜)</strong>, inspired by a true story as told in an award-winning <em>Los Angeles Times </em>article by AAJA member Frank Shyong. This screening, presented by The Asian American Foundation (<u><a href=\"http://taaf.org/\">TAAF</a></u>), is exclusively for participants of #AAJA25. </p>\n<br>\n<p><strong>RSVP is required for this event: <a href=\"https://default.salsalabs.org/T281ed44d-33e3-4ff9-a5f5-c162ddc856ab/dd3459ba-1a0d-4337-aaca-10ccbaebc4e4\" target=\"_blank\">RSVP here</a>. </strong>Please do not share this link outside of #AAJA25 attendees. Seating is limited. Once we reach capacity, you will be placed on a waitlist.</p>\n<p><br><strong>Please ensure you arrive early to secure your seat.</strong> </p>\n<p>AAJA staff will be on-site by 11:45am to check you in. If you don’t check in by 12pm, your seat will be given to those on the waitlist. Screening will start promptly at 12:30pm. (ROSEMEAD runtime: 97 minutes) </p>\n<br>\n<br>",
      "start_time": "2025-08-02T19:00:00.000000+0000",
      "day": "Sat 8/2",
      "time": "12 PM PDT",
      "locations": [
        "Other"
      ],
      "tracks": []
    },
    {
      "id": 31541310,
      "name": "Seattle chapter tours: Chinatown-International District guided tour",
      "description": "<p><strong>Date</strong>: Saturday, Aug. 2 from 2 to 3:30 p.m.</p>\n<p><strong>Cost</strong>: FREE</p>\n<p><strong>Description</strong>: Join AAJA Seattle Co-Founders Ron Chew and Frank Abe on a 1.5-hour guided tour through the city’s beloved Chinatown-International District for a deep dive into the neighborhood’s history, culture and community. Ron and Frank will tell stories about different parts of the CID — including Chinatown, Nihonmachi, Little Saigon and Filipinotown — talk about their personal experiences living and working in Seattle, and highlight some of the neighborhood’s oldest and best restaurants, bakeries and cafes. Max 30 people.</p>\n<p>**Your spot is NOT confirmed until a confirmation email is sent back to you.</p>\n<p><strong>Link</strong>: <u><a href=\"https://forms.gle/F9CMC5Ka6ZZmRNZ28\">https://forms.gle/F9CMC5Ka6ZZmRNZ28</a></u></p>",
      "start_time": "2025-08-02T21:00:00.000000+0000",
      "day": "Sat 8/2",
      "time": "2 PM PDT",
      "locations": [
        "Other"
      ],
      "tracks": [
        "Mixers/Receptions"
      ]
    },
    {
      "id": 31362656,
      "name": "Annual gala scholarship & awards banquet (Presented by NBCUniversal)",
      "description": "<p>Join us for the elegant and inspiring finale of AAJA25 at the Annual Gala Scholarship &amp; Awards Banquet—an evening dedicated to celebrating excellence in journalism and championing future AAPI media leaders.</p>\n<br>\n<br>",
      "start_time": "2025-08-03T01:00:00.000000+0000",
      "day": "Sat 8/2",
      "time": "6 PM PDT",
      "locations": [
        "GRAND BALLROOM"
      ],
      "tracks": [
        "Mixers/Receptions"
      ]
    },
    {
      "id": 31519944,
      "name": "Karaoke!",
      "description": "<p>Unwind, sing your heart out, and cheer on your fellow AAJAers at one of the most anticipated and iconic traditions of the convention—Karaoke Night!</p>\n<br>\n<p>Step up to the mic for a shot at winning the coveted AAJA George Kiriyama Karaoke Award—complete with a real trophy and eternal bragging rights.</p>",
      "start_time": "2025-08-03T04:00:00.000000+0000",
      "day": "Sat 8/2",
      "time": "9 PM PDT",
      "locations": [
        "METROPOLITAN A"
      ],
      "tracks": [
        "Mixers/Receptions"
      ]
    }
  ]
}